tangyangguang/Esp32_Fan_4P/src/web/FanWeb.cpp
void FanWeb::handleStatusPage() {
    if (!Esp32BaseWeb::checkAuth()) return;
    ESP32BASE_LOG_I("FanWeb", "page_view path=/fan");

    Esp32BaseWeb::sendHeader();
    Esp32BaseWeb::sendChunk(APP_STYLE);
    Esp32BaseWeb::sendChunk(FAN_PAGE_TOP);

    char buf[160];

    snprintf(buf, sizeof(buf), "%d", _controller->getCurrentSpeed());
    Esp32BaseWeb::sendChunk(buf);
    Esp32BaseWeb::sendChunk(FAN_SPEED_END);
    snprintf(buf, sizeof(buf), "%u rpm", _controller->getCurrentRpm());
    Esp32BaseWeb::sendChunk(buf);
    Esp32BaseWeb::sendChunk(FAN_RPM_END);
    if (_controller->getCurrentSpeed() == _controller->getTargetSpeed()) {
        Esp32BaseWeb::sendChunk(" style='display:none'");
    }
    Esp32BaseWeb::sendChunk(FAN_TARGET_START);
    snprintf(buf, sizeof(buf), "%d", _controller->getTargetSpeed());
    Esp32BaseWeb::sendChunk(buf);
    Esp32BaseWeb::sendChunk(FAN_TARGET_WRAP_END);

    // State
    const bool blocked = _controller->isBlocked();
    const char* stateText = "Unknown";
    switch (_controller->getState()) {
        case SYS_IDLE: stateText = "Idle"; break;
        case SYS_RUNNING: stateText = "Running"; break;
        case SYS_SLEEP: stateText = "Sleep"; break;
        case SYS_ERROR: stateText = blocked ? "Error / Blocked" : "Error"; break;
        default: break;
    }
    if (blocked && _controller->getState() != SYS_ERROR) {
        stateText = "Blocked";
    }
    snprintf(buf, sizeof(buf), "<div class='stat state'><span>State</span><b id=st class=%s>%s</b></div>",
             blocked ? "errtxt" : "", stateText);
    Esp32BaseWeb::sendChunk(buf);

    // Speed
    snprintf(buf, sizeof(buf), "<div class=stat><span>Target</span><b id=tgt>%d%%</b></div>", _controller->getTargetSpeed());
    Esp32BaseWeb::sendChunk(buf);

    snprintf(buf, sizeof(buf), "<div class=stat><span>Output</span><b id=out>%d%%</b></div>", _controller->getCurrentSpeed());
    Esp32BaseWeb::sendChunk(buf);

    snprintf(buf, sizeof(buf), "<div class=stat><span>Gear</span><b id=gear>%u</b></div>", _controller->getCurrentGear());
    Esp32BaseWeb::sendChunk(buf);

    snprintf(buf, sizeof(buf), "<div class=stat><span>RPM</span><b id=rpm>%u rpm</b></div>", _controller->getCurrentRpm());
    Esp32BaseWeb::sendChunk(buf);

    // Timer
    uint32_t timer = _controller->getTimerRemaining();
    if (timer > 0) {
        uint32_t h = timer / 3600, m = (timer % 3600) / 60, s = timer % 60;
        snprintf(buf, sizeof(buf), "%luh %lum %lus", (unsigned long)h, (unsigned long)m, (unsigned long)s);
    } else {
        strcpy(buf, "Off");
    }
    Esp32BaseWeb::sendChunk("<div class=stat><span>Timer</span><b id=tim>");
    Esp32BaseWeb::sendChunk(buf);
    Esp32BaseWeb::sendChunk("</b></div>");

    // Run Time
    char duration[24];
    formatRunDuration(_controller->getTotalRunDuration(), duration, sizeof(duration));
    snprintf(buf, sizeof(buf), "<div class=stat><span>Total run</span><b id=runTotal>%s</b></div>", duration);
    Esp32BaseWeb::sendChunk(buf);
    formatRunDuration(_controller->getBootRunDuration(), duration, sizeof(duration));
    snprintf(buf, sizeof(buf), "<div class=stat><span>Boot run</span><b id=runBoot>%s</b></div>", duration);
    Esp32BaseWeb::sendChunk(buf);

    long rssi = Esp32BaseWiFi::isConnected() ? (long)Esp32BaseWiFi::rssi() : 0;
    snprintf(buf, sizeof(buf), "<div class=stat><span>RSSI</span><b id=rssi>%ld dBm</b></div>", rssi);
    Esp32BaseWeb::sendChunk(buf);

    Esp32BaseWeb::sendChunk(FAN_STATUS_MID);
    snprintf(buf, sizeof(buf), "%d", _controller->getTargetSpeed());
    Esp32BaseWeb::sendChunk(buf);
    Esp32BaseWeb::sendChunk(FAN_SPEED_INPUT_END);
    snprintf(buf, sizeof(buf), "%lu", (unsigned long)(_controller->getTimerRemaining() / 60));
    Esp32BaseWeb::sendChunk(buf);
    Esp32BaseWeb::sendChunk(FAN_TIMER_INPUT_END);
    snprintf(buf, sizeof(buf), "%lu", (unsigned long)_controller->getTimerRemaining());
    Esp32BaseWeb::sendChunk(buf);
    Esp32BaseWeb::sendChunk(FAN_SCRIPT_TIMER_MID);

    Esp32BaseWeb::sendFooter();
}

// Config Page HTML parts
static const char CONFIG_PAGE_TOP[] PROGMEM =
    "<div class=top><div><h2>Settings</h2><div class=muted>Fan behavior and IR learning</div></div></div>"
    "<form class=panel onsubmit='saveCfg(this);return false'>"
    "<h3>Fan behavior</h3><div class=formgrid><div class=field><label>Min speed (%)</label><input type=number name=min_speed min=0 max=50 value='";
static const char CONFIG_MIN_END[] PROGMEM = "'><div class=help>Low commands rise to this value.</div></div>"
    "<div class=field><label>Sleep wait (s)</label><input type=number name=sleep_wait min=0 max=3600 value='";
static const char CONFIG_SLEEP_END[] PROGMEM = "'><div class=help>Stopped this long before modem sleep.</div></div>"
    "<div class=field><label>Soft start (ms)</label><input type=number name=soft_start min=0 max=10000 value='";
static const char CONFIG_START_END[] PROGMEM = "'><div class=help>Ramp up time.</div></div>"
    "<div class=field><label>Soft stop (ms)</label><input type=number name=soft_stop min=0 max=10000 value='";
static const char CONFIG_STOP_END[] PROGMEM = "'><div class=help>Ramp down time.</div></div>"
    "<div class=field><label>Block detect (ms)</label><input type=number name=block_detect min=100 max=5000 value='";
static const char CONFIG_BLOCK_END[] PROGMEM = "'><div class=help>No RPM for this long means blocked.</div></div>"
    "<div class=field><label>LED flash (ms)</label><input type=number name=led_flash_ms min=0 max=2000 value='";
static const char CONFIG_LED_FLASH_END[] PROGMEM = "'><div class=help>0 disables action feedback flash.</div></div>"
    "<div class=field><label>Runtime save (min)</label><input type=number name=runtime_save_min min=1 max=60 value='";
static const char CONFIG_RUNTIME_SAVE_END[] PROGMEM = "'><div class=help>Larger values reduce Flash wear; after power loss, timer and total run can lose up to this interval.</div></div>"
    "<div class=field><label>Power-on restore</label><select name=auto_restore><option value=1 ";
static const char CONFIG_AUTO_END[] PROGMEM = ">Enabled</option><option value=0 ";
static const char CONFIG_AUTO_END2[] PROGMEM = ">Disabled</option></select><div class=help>Restore last speed and timer after reboot.</div></div></div>"
    "<button id=saveBtn type=submit>Save</button><span id=saveMsg class='savebar muted'>Ready</span></form>"
    "<div class=panel><h3>IR learning</h3><div class=irlist>";
static const char CONFIG_IR_END[] PROGMEM =
    "</div><div class=help>Press one, then point the remote within 10 seconds.</div><span id=irMsg class='savebar muted'>Ready</span></div>"
    "<script>"
    "var irNames=['Speed Up','Speed Down','Stop','30 min','1 h','2 h','4 h','8 h'],irToken=0,irDeadline=0,irDup=-1,irReject=0,hitTimers={};function irName(i){return irNames[i]||('key '+i)}function irLeft(){return Math.max(0,Math.ceil((irDeadline-Date.now())/1000))}"
    "function setMsg(t,c){var m=document.getElementById('saveMsg');m.textContent=t;m.className='savebar '+c}"
    "function setIr(t,c){var m=document.getElementById('irMsg');m.textContent=t;m.className='savebar '+c}"
    "function setIrRow(i,t,c){var e=document.getElementById('irv'+i);if(e){e.textContent=t;e.className=c||''}}"
    "function hitIr(i){var e=document.getElementById('irr'+i);if(!e)return;if(hitTimers[i])clearTimeout(hitTimers[i]);e.className='irrow hit';hitTimers[i]=setTimeout(()=>{e.className='irrow';delete hitTimers[i]},600)}"
    "function applyCfg(d,f){if(!d)return;f.min_speed.value=d.min_effective_speed;f.sleep_wait.value=d.sleep_wait;f.soft_start.value=d.soft_start;f.soft_stop.value=d.soft_stop;f.block_detect.value=d.block_detect;f.led_flash_ms.value=d.led_flash_ms;f.runtime_save_min.value=d.runtime_save_min;f.auto_restore.value=d.auto_restore?1:0}"
    "function reloadCfg(f){fetch('/api/config').then(r=>r.json()).then(j=>{if(j.ok)applyCfg(j.data,f)})}"
    "function saveCfg(f){var b=document.getElementById('saveBtn');b.disabled=true;b.textContent='Saving';setMsg('Saving...','muted');fetch('/api/config',{method:'POST',body:new URLSearchParams(new FormData(f))}).then(r=>r.json().then(j=>({ok:r.ok,j:j}))).then(x=>{b.disabled=false;b.textContent='Save';if(x.ok&&x.j.ok){applyCfg(x.j.data,f);var n=x.j.changed||0;setMsg('Saved - '+(n?n+' changed':'no changes')+' - '+new Date().toLocaleTimeString(),'oktxt')}else{reloadCfg(f);setMsg(x.j&&x.j.error?x.j.error:'Save failed','errtxt')}}).catch(()=>{b.disabled=false;b.textContent='Save';setMsg('Save failed: network error','errtxt')})}"
    "function finishIr(i,n,seq,tok,retry){fetch('/api/status').then(r=>r.json()).then(j=>{if(tok!=irToken)return;var d=j.data;if(d&&d.ir_learn_seq!=seq){var v='Protocol '+d.ir_last_protocol+' - '+d.ir_last_code;setIrRow(i,v,'');setIr('Learned '+n+' - '+v,'oktxt');setTimeout(()=>location.reload(),2500)}else if(d&&d.ir_learning&&(retry||0)<2)setTimeout(()=>finishIr(i,n,seq,tok,(retry||0)+1),500);else setIr('Learn timeout - no valid signal','errtxt')}).catch(()=>{if(tok==irToken)setIr('Learn timeout - no valid signal','errtxt')})}"
    "function showLearn(n){var l=irLeft();if(l<=0)return false;if(irDup>=0)setIr('Already assigned to '+irName(irDup)+'. Press a different key - '+l+'s','errtxt');else setIr('Learning '+n+' - '+l+'s','muted');return true}"
    "function watchIr(i,n,seq,tok){if(tok!=irToken)return;if(!showLearn(n)){finishIr(i,n,seq,tok);return}fetch('/api/status').then(r=>r.json()).then(j=>{if(tok!=irToken)return;var d=j.data;if(!d)return;if(d.ir_learn_seq!=seq){var v='Protocol '+d.ir_last_protocol+' - '+d.ir_last_code;setIrRow(i,v,'');setIr('Learned '+n+' - '+v,'oktxt');setTimeout(()=>location.reload(),2500);return}if(!d.ir_learning){setIr('Learn timeout - no valid signal','errtxt');return}var nd=d.ir_duplicate_key<irNames.length?d.ir_duplicate_key:-1;if(nd>=0&&(nd!=irDup||d.ir_reject_seq!=irReject))hitIr(nd);irDup=nd;irReject=d.ir_reject_seq;setTimeout(()=>watchIr(i,n,seq,tok),500)}).catch(()=>{if(tok!=irToken)return;if(showLearn(n))setTimeout(()=>watchIr(i,n,seq,tok),500);else finishIr(i,n,seq,tok)})}"
    "function learn(i,n){irToken++;irDup=-1;irReject=0;var tok=irToken;setIr('Starting '+n+'...','muted');fetch('/api/ir/learn',{method:'POST',headers:{'Content-Type':'application/x-www-form-urlencoded'},body:'key_index='+i}).then(r=>r.json()).then(d=>{if(d.ok){irReject=d.rej_seq||0;irDeadline=Date.now()+d.timeout*1000;watchIr(i,n,d.seq,tok)}else setIr('Learn failed','errtxt')}).catch(()=>setIr('Learn failed: network error','errtxt'))}"
    "function clearIr(i,n){if(!confirm('Clear IR code for '+n+'?'))return;setIr('Clearing '+n+'...','muted');fetch('/api/ir/learn',{method:'POST',headers:{'Content-Type':'application/x-www-form-urlencoded'},body:'key_index='+i+'&clear=1'}).then(r=>r.json().then(j=>({ok:r.ok,j:j}))).then(x=>{if(x.ok&&x.j.ok){setIrRow(i,'Not learned','');setIr(x.j.changed?('Cleared '+n):('No code for '+n),x.j.changed?'oktxt':'muted');setTimeout(()=>location.reload(),600)}else setIr('Clear failed','errtxt')}).catch(()=>setIr('Clear failed: network error','errtxt'))}"
    "</script>";

void FanWeb::handleConfigPage() {
    if (!Esp32BaseWeb::checkAuth()) return;
    ESP32BASE_LOG_I("FanWeb", "page_view path=/config");

    Esp32BaseWeb::sendHeader();
    Esp32BaseWeb::sendChunk(APP_STYLE);
    Esp32BaseWeb::sendChunk(CONFIG_PAGE_TOP);

    char buf[32];

    // Min Speed
    snprintf(buf, sizeof(buf), "%d", _controller->getMinEffectiveSpeed());
    Esp32BaseWeb::sendChunk(buf);
    Esp32BaseWeb::sendChunk(CONFIG_MIN_END);

