tangyangguang/Esp32_Fan_4P/src/web/FanWeb.cpp
void FanWeb::handleApiStop() {
    if (!Esp32BaseWeb::checkAuth()) return;
    ESP32BASE_LOG_I("FanWeb", "user_action stop_fan");
    _controller->stop();
    Esp32BaseWeb::sendJson(200, "{\"ok\":true}");
}

void FanWeb::handleApiConfig() {
    if (!Esp32BaseWeb::checkAuth()) return;

    if (Esp32BaseWeb::isMethod(Esp32BaseWeb::METHOD_POST)) {
        ESP32BASE_LOG_I("FanWeb", "user_action save_config");
        uint8_t changed = 0;
        bool has_min_speed = false;
        bool has_soft_start = false;
        bool has_soft_stop = false;
        bool has_block_detect = false;
        bool has_sleep_wait = false;
        bool has_led_flash_ms = false;
        bool has_runtime_save_min = false;
        bool has_auto_restore = false;
        uint8_t min_speed = _controller->getMinEffectiveSpeed();
        uint16_t soft_start = _controller->getSoftStartTime();
        uint16_t soft_stop = _controller->getSoftStopTime();
        uint16_t block_detect = _controller->getBlockDetectTime();
        uint16_t sleep_wait = _controller->getSleepWaitTime();
        uint16_t led_flash_ms = _controller->getLedFlashDuration();
        uint8_t runtime_save_min = _controller->getRuntimeSaveIntervalMinutes();
        bool auto_restore = _controller->getAutoRestore();

        if (Esp32BaseWeb::hasParam("min_speed")) {
            uint32_t parsed = 0;
            if (!parseUintParam("min_speed", 0, 50, &parsed)) {
                Esp32BaseWeb::sendJson(400, "{\"ok\":false,\"error\":\"invalid min_speed\"}");
                return;
            }
            min_speed = static_cast<uint8_t>(parsed);
            has_min_speed = true;
        }
        if (Esp32BaseWeb::hasParam("soft_start")) {
            uint32_t parsed = 0;
            if (!parseUintParam("soft_start", 0, 10000, &parsed)) {
                Esp32BaseWeb::sendJson(400, "{\"ok\":false,\"error\":\"invalid soft_start\"}");
                return;
            }
            soft_start = static_cast<uint16_t>(parsed);
            has_soft_start = true;
        }
        if (Esp32BaseWeb::hasParam("soft_stop")) {
            uint32_t parsed = 0;
            if (!parseUintParam("soft_stop", 0, 10000, &parsed)) {
                Esp32BaseWeb::sendJson(400, "{\"ok\":false,\"error\":\"invalid soft_stop\"}");
                return;
            }
            soft_stop = static_cast<uint16_t>(parsed);
            has_soft_stop = true;
        }
        if (Esp32BaseWeb::hasParam("block_detect")) {
            uint32_t parsed = 0;
            if (!parseUintParam("block_detect", 100, 5000, &parsed)) {
                Esp32BaseWeb::sendJson(400, "{\"ok\":false,\"error\":\"invalid block_detect\"}");
                return;
            }
            block_detect = static_cast<uint16_t>(parsed);
            has_block_detect = true;
        }
        if (Esp32BaseWeb::hasParam("sleep_wait")) {
            uint32_t parsed = 0;
            if (!parseUintParam("sleep_wait", 0, 3600, &parsed)) {
                Esp32BaseWeb::sendJson(400, "{\"ok\":false,\"error\":\"invalid sleep_wait\"}");
                return;
            }
            sleep_wait = static_cast<uint16_t>(parsed);
            has_sleep_wait = true;
        }
        if (Esp32BaseWeb::hasParam("led_flash_ms")) {
            uint32_t parsed = 0;
            if (!parseUintParam("led_flash_ms", 0, 2000, &parsed)) {
                Esp32BaseWeb::sendJson(400, "{\"ok\":false,\"error\":\"invalid led_flash_ms\"}");
                return;
            }
            led_flash_ms = static_cast<uint16_t>(parsed);
            has_led_flash_ms = true;
        }
        if (Esp32BaseWeb::hasParam("runtime_save_min")) {
            uint32_t parsed = 0;
            if (!parseUintParam("runtime_save_min", 1, 60, &parsed)) {
                Esp32BaseWeb::sendJson(400, "{\"ok\":false,\"error\":\"invalid runtime_save_min\"}");
                return;
            }
            runtime_save_min = static_cast<uint8_t>(parsed);
            has_runtime_save_min = true;
        }
        if (Esp32BaseWeb::hasParam("auto_restore")) {
            uint32_t parsed = 0;
            if (!parseUintParam("auto_restore", 0, 1, &parsed)) {
                Esp32BaseWeb::sendJson(400, "{\"ok\":false,\"error\":\"invalid auto_restore\"}");
                return;
            }
            auto_restore = parsed != 0;
            has_auto_restore = true;
        }

        if (has_min_speed && min_speed != _controller->getMinEffectiveSpeed()) {
            _controller->setMinEffectiveSpeed(min_speed);
            changed++;
        }
        if (has_soft_start && soft_start != _controller->getSoftStartTime()) {
            _controller->setSoftStartTime(soft_start);
            changed++;
        }
        if (has_soft_stop && soft_stop != _controller->getSoftStopTime()) {
            _controller->setSoftStopTime(soft_stop);
            changed++;
        }
        if (has_block_detect && block_detect != _controller->getBlockDetectTime()) {
            _controller->setBlockDetectTime(block_detect);
            changed++;
        }
        if (has_sleep_wait && sleep_wait != _controller->getSleepWaitTime()) {
            _controller->setSleepWaitTime(sleep_wait);
            changed++;
        }
        if (has_led_flash_ms && led_flash_ms != _controller->getLedFlashDuration()) {
            _controller->setLedFlashDuration(led_flash_ms);
            changed++;
        }
        if (has_runtime_save_min && runtime_save_min != _controller->getRuntimeSaveIntervalMinutes()) {
            _controller->setRuntimeSaveIntervalMinutes(runtime_save_min);
            changed++;
        }
        if (has_auto_restore && auto_restore != _controller->getAutoRestore()) {
            _controller->setAutoRestore(auto_restore);
            changed++;
        }

        bool flushed = Esp32BaseConfig::flushAll();
        if (flushed && changed > 0) {
            _controller->notifyUserAction();
        }
        ESP32BASE_LOG_I("FanWeb", "config_save_complete changed=%u flushed=%u",
                          (unsigned)changed, flushed ? 1U : 0U);
        char buf[320];
        snprintf(buf, sizeof(buf),
            "{\"ok\":%s,\"changed\":%u,\"flushed\":%s,\"data\":{\"min_effective_speed\":%d,\"soft_start\":%d,\"soft_stop\":%d,"
            "\"block_detect\":%d,\"sleep_wait\":%d,\"led_flash_ms\":%d,\"runtime_save_min\":%u,\"auto_restore\":%s}}",
            flushed ? "true" : "false",
            (unsigned)changed,
            flushed ? "true" : "false",
            _controller->getMinEffectiveSpeed(),
            _controller->getSoftStartTime(),
            _controller->getSoftStopTime(),
            _controller->getBlockDetectTime(),
            _controller->getSleepWaitTime(),
            _controller->getLedFlashDuration(),
            _controller->getRuntimeSaveIntervalMinutes(),
            _controller->getAutoRestore() ? "true" : "false"
        );
        Esp32BaseWeb::sendJson(flushed ? 200 : 500, buf);
    } else {
        char buf[320];
        snprintf(buf, sizeof(buf),
            "{\"ok\":true,\"data\":{\"min_effective_speed\":%d,\"soft_start\":%d,\"soft_stop\":%d,"
            "\"block_detect\":%d,\"sleep_wait\":%d,\"led_flash_ms\":%d,\"runtime_save_min\":%u,\"auto_restore\":%s}}",
            _controller->getMinEffectiveSpeed(),
            _controller->getSoftStartTime(),
            _controller->getSoftStopTime(),
            _controller->getBlockDetectTime(),
            _controller->getSleepWaitTime(),
            _controller->getLedFlashDuration(),
            _controller->getRuntimeSaveIntervalMinutes(),
            _controller->getAutoRestore() ? "true" : "false"
        );
        Esp32BaseWeb::sendJson(200, buf);
    }
}

